ОперативныеЗадачиКР/src/Reports/КомплектующиеНаСкладе_БезСКД/КомплектующиеНаСкладе_БезСКД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>КомплектующиеНаСкладе_БезСКД</name>
</mdclass:Report>

ОперативныеЗадачиКР/src/AccumulationRegisters/ОстаткиКомплектующих/ОстаткиКомплектующих.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиКомплектующих</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Комплектующая</name>
    <type>
      <types>CatalogRef.Комплектующие</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ОперативныеЗадачиКР/src/InformationRegisters/СпецификацииКомпьютеров/СпецификацииКомпьютеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СпецификацииКомпьютеров</name>
  <resources>
    <name>Комплектующая</name>
    <type>
      <types>CatalogRef.Комплектующие</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Компьютер</name>
    <type>
      <types>CatalogRef.Компьютеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СвойствоКомпьютера</name>
    <type>
      <types>CatalogRef.СвойстваКомпьютеров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ОперативныеЗадачиКР/src/Reports/КомплектующиеНаСкладе_БезСКД/Forms/ФормаОтчета/Module.bsl
&НаКлиенте
Процедура Сформировать(Команда)

	ТабДок = СформироватьТабличныйДокумент(ДатаОтчета);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция  СформироватьТабличныйДокумент(парДата);

	ТабДок = Новый ТабличныйДокумент;

	Макет = Отчеты.КомплектующиеНаСкладе_БезСКД.ПолучитьМакет("Макет1");
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиКомплектующихОстатки.Комплектующая,
		|	ПРЕДСТАВЛЕНИЕ(ОстаткиКомплектующихОстатки.Комплектующая),
		|	ОстаткиКомплектующихОстатки.КоличествоОстаток КАК Количество,
		|	СпецификацииКомпьютеров.СвойствоКомпьютера КАК Свойство,
		|	ПРЕДСТАВЛЕНИЕ(СпецификацииКомпьютеров.СвойствоКомпьютера)
		|ИЗ
		|	РегистрНакопления.ОстаткиКомплектующих.Остатки(&ДатаОтчета, ) КАК ОстаткиКомплектующихОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СпецификацииКомпьютеров КАК СпецификацииКомпьютеров
		|		ПО ОстаткиКомплектующихОстатки.Комплектующая = СпецификацииКомпьютеров.Комплектующая
		|ИТОГИ
		|	СУММА(Количество)
		|ПО
		|	Свойство";

	Запрос.УстановитьПараметр("ДатаОтчета", Новый Граница(КонецДня(парДата),ВидГраницы.Включая));

	Результат = Запрос.Выполнить();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьСвойство = Макет.ПолучитьОбласть("Свойство");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");

	ТабДок.Очистить();
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.НачатьАвтогруппировкуСтрок();

	ВыборкаСвойство = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока ВыборкаСвойство.Следующий() Цикл
		ОбластьСвойство.Параметры.Заполнить(ВыборкаСвойство);
		ТабДок.Вывести(ОбластьСвойство, ВыборкаСвойство.Уровень());

		ВыборкаДетальныеЗаписи = ВыборкаСвойство.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
			ТабДок.Вывести(ОбластьДетальныхЗаписей, ВыборкаДетальныеЗаписи.Уровень());
		КонецЦикла;
	КонецЦикла;

	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ТабДок.Вывести(ОбластьПодвалТаблицы);
	ТабДок.Вывести(ОбластьПодвал);

	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
	Возврат ТабДок;
	
	
КонецФункции


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДатаОтчета = ТекущаяДата();
	
КонецПроцедуры
